Дипломная_работа/src/Documents/BKM_НачислениеЗарплаты/BKM_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_НачислениеЗарплаты</name>
  <registerRecords>AccumulationRegister.BKM_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.BKM_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.BKM_Удержания</registerRecords>
  <registerRecords>CalculationRegister.BKM_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>BKM_ПериодНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>BKM_Начисления</name>
    <attributes>
      <name>BKM_СуммаОклада</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BKM_СуммаПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BKM_СуммаОтпускных</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BKM_СуммаНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BKM_НДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BKM_КВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BKM_Сотрудник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломная_работа/src/InformationRegisters/BKM_УсловияОплатыСотрудников/BKM_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BKM_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>BKM_Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>BKM_ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>BKM_Сотрудник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дипломная_работа/src/AccumulationRegisters/BKM_ВыполненныеСотрудникомРаботы/BKM_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BKM_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>BKM_ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>BKM_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>BKM_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дипломная_работа/src/Documents/BKM_НачислениеЗарплаты/ObjectModule.bsl
// Файл: Конфигурация/src/Documents/BKM_НачислениеЗарплаты/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Заполняет табличную часть документа начисления зарплаты на основе
// данных о сотрудниках, условиях оплаты и выполненных работах.
//
Процедура BKM_ВыполнитьЗаполнение() Экспорт

	Если BKM_ПериодНачисления = Неопределено Тогда
		ВызватьИсключение "Не заполнен период начисления.";
	КонецЕсли;

	ПериодНач = НачалоМесяца(BKM_ПериодНачисления);
	ПериодКон = КонецМесяца(BKM_ПериодНачисления);

	BKM_Начисления.Очистить();

	// 1) Список сотрудников
	ЗапросСотр = Новый Запрос;
	ЗапросСотр.Текст =
	"ВЫБРАТЬ
	|	Сотр.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.BKM_Сотрудники КАК Сотр
	|ГДЕ
	|	Сотр.ПометкаУдаления = ЛОЖЬ";

	ТабСотр = ЗапросСотр.Выполнить().Выгрузить();

	Если ТабСотр.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// 2) Оклады (последняя запись условий на месяц по каждому сотруднику)
	ЗапросОклад = Новый Запрос;
	ЗапросОклад.Текст =
	"ВЫБРАТЬ
	|	Усл.BKM_Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(Усл.Период) КАК Период
	|ИЗ
	|	РегистрСведений.BKM_УсловияОплатыСотрудников КАК Усл
	|ГДЕ
	|	Усл.BKM_Сотрудник В (&Сотрудники)
	|	И Усл.Период <= &Период
	|СГРУППИРОВАТЬ ПО
	|	Усл.BKM_Сотрудник";

	ЗапросОклад.УстановитьПараметр("Сотрудники", ТабСотр.ВыгрузитьКолонку("Сотрудник"));
	ЗапросОклад.УстановитьПараметр("Период", ПериодНач);

	ТабПериодов = ЗапросОклад.Выполнить().Выгрузить();

	Оклады = Новый Соответствие;

	Если ТабПериодов.Количество() > 0 Тогда

		ЗапросОклад2 = Новый Запрос;
		ЗапросОклад2.Текст =
		"ВЫБРАТЬ
		|	Усл.BKM_Сотрудник КАК Сотрудник,
		|	Усл.BKM_Оклад КАК Оклад
		|ИЗ
		|	РегистрСведений.BKM_УсловияОплатыСотрудников КАК Усл
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ &ТабПериодов КАК П
		|	ПО Усл.BKM_Сотрудник = П.Сотрудник
		|	И Усл.Период = П.Период";

		ЗапросОклад2.УстановитьПараметр("ТабПериодов", ТабПериодов);

		ВыборкаОклад = ЗапросОклад2.Выполнить().Выбрать();
		Пока ВыборкаОклад.Следующий() Цикл
			Оклады.Вставить(ВыборкаОклад.Сотрудник, ВыборкаОклад.Оклад);
		КонецЦикла;

	КонецЕсли;

	// 3) Сумма работ за месяц по регистру накопления
	ЗапросРаб = Новый Запрос;
	ЗапросРаб.Текст =
	"ВЫБРАТЬ
	|	Раб.BKM_Сотрудник КАК Сотрудник,
	|	СУММА(Раб.BKM_СуммаКОплате) КАК Сумма
	|ИЗ
	|	РегистрНакопления.BKM_ВыполненныеСотрудникомРаботы.Обороты(&ПериодНач, &ПериодКон, , ) КАК Раб
	|ГДЕ
	|	Раб.BKM_Сотрудник В (&Сотрудники)
	|СГРУППИРОВАТЬ ПО
	|	Раб.BKM_Сотрудник";

	ЗапросРаб.УстановитьПараметр("ПериодНач", ПериодНач);
	ЗапросРаб.УстановитьПараметр("ПериодКон", ПериодКон);
	ЗапросРаб.УстановитьПараметр("Сотрудники", ТабСотр.ВыгрузитьКолонку("Сотрудник"));

	Работы = Новый Соответствие;

	ВРаб = ЗапросРаб.Выполнить().Выбрать();
	Пока ВРаб.Следующий() Цикл
		Работы.Вставить(ВРаб.Сотрудник, ВРаб.Сумма);
	КонецЦикла;

	// 4) Заполняем табличную часть БЕЗ запросов в цикле
	Для каждого СтрСотр Из ТабСотр Цикл

		Сотр = СтрСотр.Сотрудник;

		Оклад = 0;
		Если Оклады.СодержитКлюч(Сотр) Тогда
			Оклад = Оклады[Сотр];
		КонецЕсли;

		СуммаПроцент = 0;
		Если Работы.СодержитКлюч(Сотр) Тогда
			СуммаПроцент = Работы[Сотр];
		КонецЕсли;

		Отпускные = 0;

		Стр = BKM_Начисления.Добавить();
		Стр.BKM_Сотрудник = Сотр;
		Стр.BKM_СуммаОклада = Оклад;
		Стр.BKM_СуммаПроцент = СуммаПроцент;
		Стр.BKM_СуммаОтпускных = Отпускные;

		Начислено = Оклад + СуммаПроцент + Отпускные;
		Стр.BKM_СуммаНачислено = Начислено;

		НДФЛ = Окр(Начислено * 0.13, 2);
		Стр.BKM_НДФЛ = НДФЛ;

		Стр.BKM_КВыплате = Начислено - НДФЛ;

	КонецЦикла;

КонецПроцедуры
#КонецОбласти
